Catalogs/ВидыЛьгот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВидыЛьгот</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НумерацияЗаявленийСначалаВНовомГоду</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстДляШапкиРешенияУтвердить</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстДляШапкиРешенияОтказать</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛьготныеКатегории</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛьготныеКатегории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыДляЛьготы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДокументыПоВидам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛьготныеКатегории</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КомплектностьДокумента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подстановка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВидыЛьгот/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ВернутьСписокПодстановкиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛьготныеКатегории.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЛьготныеКатегории КАК ЛьготныеКатегории";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	СписокВыбора = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		СписокВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Если СписокВыбора.Количество() > 0 Тогда
        Возврат СписокВыбора;
    Иначе
        Возврат Неопределено;
    КонецЕсли;

КонецФункции


&НаКлиенте
Процедура ДокументыДляЛьготыЛьготныеКатегорииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СписокВыбора = ВернутьСписокПодстановкиНаСервере();
	
	ЭлементыПодстановки = СписокВыбора.ОтметитьЭлементы("Выберите льготные категории");
    КомплектностьСтрока = "";
    
    Если ЭлементыПодстановки = Истина Тогда
        
        ТЧ = Объект.КомплектностьДокумента;
        ТЧ.Очистить();
        
        Для Каждого ЭлементСписка Из СписокВыбора Цикл
            Если ЭлементСписка.Пометка Тогда
                СтрокаТЧ = ТЧ.Добавить();
                СтрокаТЧ.Подстановка = ЭлементСписка.Значение;
                КомплектностьСтрока  = КомплектностьСтрока + ЭлементСписка.Значение + ", ";
            КонецЕсли;
        КонецЦикла;
        
        КомплектностьСтрока  = Лев(КомплектностьСтрока, СтрДлина(КомплектностьСтрока) - 2);
        Элементы.ДокументыДляЛьготы.ТекущиеДанные.ЛьготныеКатегории = КомплектностьСтрока;
        Модифицированность   = Истина;
        
    КонецЕсли;
КонецПроцедуры
